# EA_GetUnitStr

## Description
Returns document unit string.

```pascal
FUNCTION EA_GetUnitStr(unitType : INTEGER) : STRING;
```

```python

def vs.EA_GetUnitStr(unitType):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|unitType|INTEGER||

## Version
Availability: from Vectorworks 2016
## Category
* EnergyAnalysis Interface Library